app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def current_user
        begin
            method, token = request.headers['Authorization'].split(' ')
            payload, header = decode_token(token)

            User.find(payload["user_id"])