app/controllers/events_controller.rb

    def index
        render json: Event.all
---
SELECT "events".* FROM "events"

    def define_current_event
        if params[:id]
            @current_event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]