app/controllers/events_controller.rb

    def create_organizer
        event = Event.create(event_params)
---
INSERT INTO "events" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Learn Programming"], ["description", "Learn to program with friends!"], ["created_at", "2019-02-14 23:59:55.335943"], ["updated_at", "2019-02-14 23:59:55.335943"]]