app/controllers/events_controller.rb

    def create
        event = Event.create(event_params)

        event.organizers << current_user
---
INSERT INTO "events" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Notes on happiness"], ["description", "Be happy!"], ["created_at", "2019-02-15 00:41:31.764197"], ["updated_at", "2019-02-15 00:41:31.764197"]]
INSERT INTO "user_events" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["event_id", 18], ["created_at", "2019-02-15 00:41:31.824965"], ["updated_at", "2019-02-15 00:41:31.824965"]]

    def create_attendee

        current_event.attendees << current_user
---
INSERT INTO "events" ("date", "title", "description", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def index
        render json: Event.all
---
SELECT "events".* FROM "events"

    def show
        showevent = Event.all.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def define_current_event
        if params[:id]
            @current_event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]