app/controllers/users_controller.rb

    def organizers
        # organizerUser = UserEvent.select {
        #      |x| x.user_id === params[:id]
        #  }
        #  arrayOfEventsId = organizerUser.map{|e| e.event_id}
        #  list = arrayOfEventsId.map{|e| Event.all.select{|s| s.id === e}}
        render json: [UserEvent.all, Event.all]
---
SELECT "user_events".* FROM "user_events"

     def attending
        render json: [UserArrangement.all, Event.all]
---
SELECT "user_arrangements".* FROM "user_arrangements"
SELECT "user_events".* FROM "user_events"

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "name", "school", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def define_selected_user
        if params[:id]
            @selected_user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]