app/controllers/users_controller.rb

    def define_current_user
        if params[:id]
            @current_user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]