app/controllers/user_events_controller.rb

    def create
        userevent = UserEvent.create(userevent_params)
---
INSERT INTO "events" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-02-14 22:03:30.826709"], ["updated_at", "2019-02-14 22:03:30.826709"]]